module Transition.Concur where

   open import SharedModules hiding ([_])

   open import Ext

   open import Action as ᴬ
      using (Action; Actionᵇ; Actionᶜ; _ᵇ; _ᶜ; inc; _ᴬ⌣_; ᴬ⌣-sym; ᴬ⌣-sym-involutive; ᴺinc-inc);
      open ᴬ.Actionᵇ; open ᴬ.Actionᶜ; open ᴬ._ᴬ⌣_
   import Action.Ren
   open import Name as ᴺ using (Name; Cxt; module Cxt; zero; _+_; toℕ)
   open import Ren as ᴿ using (Ren; Renameable; ᴺren; suc; push; pop; swap); open ᴿ.Renameable ⦃...⦄
   open import Ren.Properties
   open import Proc as ᴾ using (Proc); open ᴾ.Proc
   import Proc.Ren
   open import Transition as ᵀ using (_—[_-_]→_; target); open ᵀ._—[_-_]→_
   open import Transition.Ren using (_*ᵇ; _*ᶜ)

   -- Second component here abstracts over the two action constructors.
   ᴬΔ : ∀ {Γ} {a a′ : Action Γ} → a ᴬ⌣ a′ → Σ[ A ∈ Set ] (A → Action (Γ + inc a))
   ᴬΔ {Γ} ᵛ∇ᵛ = Actionᶜ (Γ + 1) , _ᶜ
   ᴬΔ {Γ} ᵇ∇ᵇ = Actionᵇ (Γ + 1) , _ᵇ
   ᴬΔ {Γ} ᵇ∇ᶜ = Actionᶜ (Γ + 1) , _ᶜ
   ᴬΔ {Γ} ᶜ∇ᵇ = Actionᵇ Γ , _ᵇ
   ᴬΔ {Γ} ᶜ∇ᶜ = Actionᶜ Γ , _ᶜ

   -- The residual a′/a. Note that ᵇ∇ᵇ may also relate two bound outputs, but only if they represent
   -- extrusions of distinct binders.
   ᴬ/ : ∀ {Γ} {a a′ : Action Γ} (a⌣a′ : a ᴬ⌣ a′) → π₁ (ᴬΔ a⌣a′)
   ᴬ/ (ᵛ∇ᵛ {u = u}) = • ᴺ.suc u 〈 zero 〉
   ᴬ/ (ᵇ∇ᵇ {a′ = a′}) = (push *) a′
   ᴬ/ (ᵇ∇ᶜ {a′ = a′}) = (push *) a′
   ᴬ/ (ᶜ∇ᵇ {a′ = a′}) = a′
   ᴬ/ (ᶜ∇ᶜ {a′ = a′}) = a′

   -- Symmetrise.
   ᴬ⊖ : ∀ {Γ} {a a′ : Action Γ} (a⌣a′ : a ᴬ⌣ a′) → Action (Γ + inc a) × Action (Γ + inc a′)
   ᴬ⊖ a⌣a′ = π₂ (ᴬΔ a⌣a′) (ᴬ/ a⌣a′) , π₂ (ᴬΔ (ᴬ⌣-sym a⌣a′)) (ᴬ/ (ᴬ⌣-sym a⌣a′))

   -- A pair of composable actions.
   Action₂ : Cxt → Set
   Action₂ Γ = Σ[ a ∈ Action Γ ] Action (Γ + inc a)

   inc₂ : ∀ {Γ} → Action₂ Γ → Cxt
   inc₂ (a , a′) = inc a + inc a′

   inc₂-def : ∀ {Γ} {a a′ : Action Γ} (a⌣a′ : a ᴬ⌣ a′) → Γ + inc₂ (a , π₁ (ᴬ⊖ a⌣a′)) ≡ Γ + inc a + inc (π₁ (ᴬ⊖ a⌣a′))
   inc₂-def ᵛ∇ᵛ = refl
   inc₂-def ᵇ∇ᵇ = refl
   inc₂-def ᵇ∇ᶜ = refl
   inc₂-def ᶜ∇ᵇ = refl
   inc₂-def ᶜ∇ᶜ = refl

   -- Cofinality of action residuals is simply agreement on target context.
   ᴬ⊖-✓ : ∀ {Γ} {a a′ : Action Γ} (a⌣a′ : a ᴬ⌣ a′) → Γ + inc a + inc (π₁ (ᴬ⊖ a⌣a′)) ≡ Γ + inc a′ + inc (π₂ (ᴬ⊖ a⌣a′))
   ᴬ⊖-✓ ᵛ∇ᵛ = refl
   ᴬ⊖-✓ ᵇ∇ᵇ = refl
   ᴬ⊖-✓ ᵇ∇ᶜ = refl
   ᴬ⊖-✓ ᶜ∇ᵇ = refl
   ᴬ⊖-✓ ᶜ∇ᶜ = refl

   -- Whether two coinitial evaluation contexts are concurrent; define asymmetrically and then close under symmetry.
   -- However, this is _not_ the "symmetric reduction" of the symmetric version; when proving preservation of
   -- concurrency by residuation, it's useful to include the symmetrisation of some rules in this definition. In
   -- particular the │ᶜᵇ, ᶜᵇ│, │•ᵥ and νᶜᵇ cases are all implied by symmetry, but nevertheless defined here.
   -- Convenient to have this indexed by the kind of action residual. TODO: cases for •│ and ᵥ│.
   syntax Concur₁ E E′ a′/a = E ⌣₁[ a′/a ] E′
   infix 4 Concur₁

   data Concur₁ {Γ} : ∀ {a a′ : Action Γ} {P R R′} →
                P —[ a - _ ]→ R → P —[ a′ - _ ]→ R′ → a ᴬ⌣ a′ → Set where
      _ᵇ│ᵇ_ : ∀ {P Q R S} {a a′ : Actionᵇ Γ}
             (E : P —[ a ᵇ - _ ]→ R) (F : Q —[ a′ ᵇ - _ ]→ S) → E ᵇ│ Q ⌣₁[ ᵇ∇ᵇ ] P │ᵇ F
      _ᵇ│ᶜ_ : ∀ {P Q R S} {a : Actionᵇ Γ} {a′ : Actionᶜ Γ}
             (E : P —[ a ᵇ - _ ]→ R) (F : Q —[ a′ ᶜ - _ ]→ S) → E ᵇ│ Q ⌣₁[ ᵇ∇ᶜ ] P │ᶜ F
      _ᶜ│ᵇ_ : ∀ {P Q R S} {a : Actionᶜ Γ} {a′ : Actionᵇ Γ}  →
             (E : P —[ a ᶜ - _ ]→ R) (F : Q —[ a′ ᵇ - _ ]→ S) → E ᶜ│ Q ⌣₁[ ᶜ∇ᵇ ] P │ᵇ F
      _ᶜ│ᶜ_ : ∀ {P Q R S} {a a′ : Actionᶜ Γ}  →
             (E : P —[ a ᶜ - _ ]→ R) (F : Q —[ a′ ᶜ - _ ]→ S) → E ᶜ│ Q ⌣₁[ ᶜ∇ᶜ ] P │ᶜ F
      -- │ᵇ• might be a better naming convention here, and similarly for │ᵇᵥ.
      _│•ᵇ_ : ∀ {x y P R R′ S Q} {a : Actionᵇ Γ} {E : P —[ a ᵇ - _ ]→ R} {E′ : P —[ x • ᵇ - _ ]→ R′} →
              E ⌣₁[ ᵇ∇ᵇ ] E′ → (F : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S) → E ᵇ│ Q ⌣₁[ ᵇ∇ᶜ ] E′ │• F
      _│•ᶜ_ : ∀ {x y P R R′ S Q} {a : Actionᶜ Γ} {E : P —[ a ᶜ - _ ]→ R} {E′ : P —[ x • ᵇ - _ ]→ R′} →
              E ⌣₁[ ᶜ∇ᵇ ] E′ → (F : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S) → E ᶜ│ Q ⌣₁[ ᶜ∇ᶜ ] E′ │• F
      _ᵇ│•_ : ∀ {x y P Q R S S′} {a : Actionᵇ Γ} {F : Q —[ a ᵇ - _ ]→ S} {F′ : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S′}
              (E : P —[ x • ᵇ - _ ]→ R) → F ⌣₁[ ᵇ∇ᶜ ] F′ → P │ᵇ F ⌣₁[ ᵇ∇ᶜ ] E │• F′
      _ᶜ│•_ : ∀ {x y P Q R S S′} {a : Actionᶜ Γ} {F : Q —[ a ᶜ - _ ]→ S} {F′ : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S′}
              (E : P —[ x • ᵇ - _ ]→ R) → F ⌣₁[ ᶜ∇ᶜ ] F′ → P │ᶜ F ⌣₁[ ᶜ∇ᶜ ] E │• F′
      _│ᵥᵇ_ : ∀ {x P R R′ S Q} {a : Actionᵇ Γ} {E : P —[ a ᵇ - _ ]→ R} {E′ : P —[ x • ᵇ - _ ]→ R′} →
             E ⌣₁[ ᵇ∇ᵇ ] E′ → (F : Q —[ (• x) ᵇ - _ ]→ S) → E ᵇ│ Q ⌣₁[ ᵇ∇ᶜ ] E′ │ᵥ F
      _│ᵥᶜ_ : ∀ {x P R R′ S Q} {a : Actionᶜ Γ} {E : P —[ a ᶜ - _ ]→ R} {E′ : P —[ x • ᵇ - _ ]→ R′} →
              E ⌣₁[ ᶜ∇ᵇ ] E′ → (F : Q —[ (• x) ᵇ - _ ]→ S) → E ᶜ│ Q ⌣₁[ ᶜ∇ᶜ ] E′ │ᵥ F
      _ᵇ│ᵥ_ : ∀ {x P Q R S S′} {a : Actionᵇ Γ} {a⌣a′} {F : Q —[ a ᵇ - _ ]→ S} {F′ : Q —[ (• x) ᵇ - _ ]→ S′} →
             (E : P —[ x • ᵇ - _ ]→ R) → F ⌣₁[ a⌣a′ ] F′ → P │ᵇ F ⌣₁[ ᵇ∇ᶜ ] E │ᵥ F′
      _ᶜ│ᵥ_ : ∀ {x P Q R S S′} {a : Actionᶜ Γ} {F : Q —[ a ᶜ - _ ]→ S} {F′ : Q —[ (• x) ᵇ - _ ]→ S′} →
             (E : P —[ x • ᵇ - _ ]→ R) → F ⌣₁[ ᶜ∇ᵇ ] F′ → P │ᶜ F ⌣₁[ ᶜ∇ᶜ ] E │ᵥ F′
      _➕₁_ : ∀ {P} {a : Action Γ} {a′ : Action Γ} {a⌣a′} {R R′} {E : P —[ a - _ ]→ R} {E′ : P —[ a′ - _ ]→ R′} →
             E ⌣₁[ a⌣a′ ] E′ → (Q : Proc Γ) → E ➕₁ Q ⌣₁[ a⌣a′ ] E′ ➕₁ Q
      _│ᵇᵇ_ : ∀ {Q S S′} {a a′ : Actionᵇ Γ} {a⌣a′} {F : Q —[ a ᵇ - _ ]→ S} {F′ : Q —[ a′ ᵇ - _ ]→ S′} →
             (P : Proc Γ) → F ⌣₁[ a⌣a′ ] F′ → P │ᵇ F ⌣₁[ a⌣a′ ] P │ᵇ F′
      _│ᵇᶜ_ : ∀ {Q S S′} {a : Actionᵇ Γ} {a′ : Actionᶜ Γ} {F : Q —[ a ᵇ - _ ]→ S} {F′ : Q —[ a′ ᶜ - _ ]→ S′} →
             (P : Proc Γ) → F ⌣₁[ ᵇ∇ᶜ ] F′ → P │ᵇ F ⌣₁[ ᵇ∇ᶜ ] P │ᶜ F′
      _│ᶜᵇ_ : ∀ {Q S S′} {a : Actionᶜ Γ} {a′ : Actionᵇ Γ} {F : Q —[ a ᶜ - _ ]→ S} {F′ : Q —[ a′ ᵇ - _ ]→ S′} →
             (P : Proc Γ) → F ⌣₁[ ᶜ∇ᵇ ] F′ → P │ᶜ F ⌣₁[ ᶜ∇ᵇ ] P │ᵇ F′
      _│ᶜᶜ_ : ∀ {Q S S′} {a a′ : Actionᶜ Γ} {F : Q —[ a ᶜ - _ ]→ S} {F′ : Q —[ a′ ᶜ - _ ]→ S′} →
             (P : Proc Γ) → F ⌣₁[ ᶜ∇ᶜ ] F′ → P │ᶜ F ⌣₁[ ᶜ∇ᶜ ] P │ᶜ F′
      _ᵇᵇ│_ : ∀ {P R R′} {a a′ : Actionᵇ Γ} {a⌣a′} {E : P —[ a ᵇ - _ ]→ R} {E′ : P —[ a′ ᵇ - _ ]→ R′} →
              E ⌣₁[ a⌣a′ ] E′ → (Q : Proc Γ) → E ᵇ│ Q ⌣₁[ a⌣a′ ] E′ ᵇ│ Q
      _ᵇᶜ│_ : ∀ {P R R′} {a : Actionᵇ Γ} {a′ : Actionᶜ Γ} {E : P —[ a ᵇ - _ ]→ R} {E′ : P —[ a′ ᶜ - _ ]→ R′} →
              E ⌣₁[ ᵇ∇ᶜ ] E′ → (Q : Proc Γ) → E ᵇ│ Q ⌣₁[ ᵇ∇ᶜ ] E′ ᶜ│ Q
      _ᶜᵇ│_ : ∀ {P R R′} {a : Actionᶜ Γ} {a′ : Actionᵇ Γ} {E : P —[ a ᶜ - _ ]→ R} {E′ : P —[ a′ ᵇ - _ ]→ R′} →
              E ⌣₁[ ᶜ∇ᵇ ] E′ → (Q : Proc Γ) → E ᶜ│ Q ⌣₁[ ᶜ∇ᵇ ] E′ ᵇ│ Q
      _ᶜᶜ│_ : ∀ {P R R′} {a a′ : Actionᶜ Γ} {E : P —[ a ᶜ - _ ]→ R} {E′ : P —[ a′ ᶜ - _ ]→ R′} →
              E ⌣₁[ ᶜ∇ᶜ ] E′ → (Q : Proc Γ) → E ᶜ│ Q ⌣₁[ ᶜ∇ᶜ ] E′ ᶜ│ Q
      _│•_ : ∀ {x y u z P Q R R′ S S′} {E : P —[ x • ᵇ - _ ]→ R} {E′ : P —[ u • ᵇ - _ ]→ R′}
             {F : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S} {F′ : Q —[ • u 〈 z 〉 ᶜ - _ ]→ S′} →
             E ⌣₁[ ᵇ∇ᵇ ] E′ → F ⌣₁[ ᶜ∇ᶜ ] F′ → E │• F ⌣₁[ ᶜ∇ᶜ ] E′ │• F′
      _│•ᵥ_ : ∀ {x u y P Q R R′ S S′} {E : P —[ x • ᵇ - _ ]→ R} {E′ : P —[ u • ᵇ - _ ]→ R′}
             {F : Q —[ • x 〈 y 〉 ᶜ - _ ]→ S} {F′ : Q —[ (• u) ᵇ - _ ]→ S′} →
             E ⌣₁[ ᵇ∇ᵇ ] E′ → F ⌣₁[ ᶜ∇ᵇ ] F′ → E │• F ⌣₁[ ᶜ∇ᶜ ] E′ │ᵥ F′
      _│ᵥ•_ : ∀ {x u y P Q R R′ S S′} {E : P —[ x • ᵇ - _ ]→ R} {E′ : P —[ u • ᵇ - _ ]→ R′}
             {F : Q —[ (• x) ᵇ - _ ]→ S} {F′ : Q —[ • u 〈 y 〉 ᶜ - _ ]→ S′} →
             E ⌣₁[ ᵇ∇ᵇ ] E′ → F ⌣₁[ ᵇ∇ᶜ ] F′ → E │ᵥ F ⌣₁[ ᶜ∇ᶜ ] E′ │• F′
      _│ᵥ_ : ∀ {x u P Q R R′ S S′} {E : P —[ x • ᵇ - _ ]→ R} {E′ : P —[ u • ᵇ - _ ]→ R′}
             {•x⌣•u} {F : Q —[ (• x) ᵇ - _ ]→ S} {F′ : Q —[ (• u) ᵇ - _ ]→ S′} →
             E ⌣₁[ ᵇ∇ᵇ ] E′ → F ⌣₁[ •x⌣•u ] F′ → E │ᵥ F ⌣₁[ ᶜ∇ᶜ ] E′ │ᵥ F′
      ν•_ : ∀ {x u P R R′} {E : P —[ • ᴺ.suc x 〈 zero 〉 ᶜ - _ ]→ R} {E′ : P —[ • ᴺ.suc u 〈 zero 〉 ᶜ - _ ]→ R′} →
            E ⌣₁[ ᶜ∇ᶜ ] E′ → ν• E ⌣₁[ ᵛ∇ᵛ ] ν• E′
      ν•ᵇ_ : ∀ {x P R R′} {a : Actionᵇ Γ} {E : P —[ • ᴺ.suc x 〈 zero 〉 ᶜ - _ ]→ R} {E′ : P —[ (push *) a ᵇ - _ ]→ R′} →
            E ⌣₁[ ᶜ∇ᵇ ] E′ → ν• E ⌣₁[ ᵇ∇ᵇ ] νᵇ E′
      ν•ᶜ_ : ∀ {x P R R′} {a : Actionᶜ Γ} {E : P —[ • ᴺ.suc x 〈 zero 〉 ᶜ - _ ]→ R} {E′ : P —[ (push *) a ᶜ - _ ]→ R′} →
            E ⌣₁[ ᶜ∇ᶜ ] E′ → ν• E ⌣₁[ ᵇ∇ᶜ ] νᶜ E′
      νᵇᵇ_ : ∀ {P R R′} {a a′ : Actionᵇ Γ} {E : P —[ (push *) a ᵇ - _ ]→ R} {E′ : P —[ (push *) a′ ᵇ - _ ]→ R′} →
          E ⌣₁[ ᵇ∇ᵇ ] E′ → νᵇ E ⌣₁[ ᵇ∇ᵇ ] νᵇ E′
      νᵛᵛ_ : ∀ {P R R′} {x u : Name Γ} {E : P —[ (• (push *) x) ᵇ - _ ]→ R} {E′ : P —[ (• (push *) u) ᵇ - _ ]→ R′} →
          E ⌣₁[ ᵛ∇ᵛ ] E′ → νᵇ E ⌣₁[ ᵛ∇ᵛ ] νᵇ E′
      νᵇᶜ_ : ∀ {P R R′} {a : Actionᵇ Γ} {a′ : Actionᶜ Γ} {E : P —[ (push *) a ᵇ - _ ]→ R} {E′ : P —[ (push *) a′ ᶜ - _ ]→ R′} →
          E ⌣₁[ ᵇ∇ᶜ ] E′ → νᵇ E ⌣₁[ ᵇ∇ᶜ ] νᶜ E′
      νᶜᵇ_ : ∀ {P R R′} {a : Actionᶜ Γ} {a′ : Actionᵇ Γ} {E : P —[ (push *) a ᶜ - _ ]→ R} {E′ : P —[ (push *) a′ ᵇ - _ ]→ R′} →
          E ⌣₁[ ᶜ∇ᵇ ] E′ → νᶜ E ⌣₁[ ᶜ∇ᵇ ] νᵇ E′
      νᶜᶜ_ : ∀ {P R R′} {a a′ : Actionᶜ Γ} {E : P —[ (push *) a ᶜ - _ ]→ R} {E′ : P —[ (push *) a′ ᶜ - _ ]→ R′} →
          E ⌣₁[ ᶜ∇ᶜ ] E′ → νᶜ E ⌣₁[ ᶜ∇ᶜ ] νᶜ E′
      !_ : ∀ {P} {a : Action Γ} {a′ : Action Γ} {a⌣a′} {R R′} {E : P │ ! P —[ a - _ ]→ R} {E′ : P │ ! P —[ a′ - _ ]→ R′} →
           E ⌣₁[ a⌣a′ ] E′ → ! E ⌣₁[ a⌣a′ ] ! E′

   ⌣-sym : ∀ {Γ} {P : Proc Γ} {a a′ : Action Γ} {a⌣a′ : a ᴬ⌣ a′} {R R′} →
           {E : P —[ a - _ ]→ R} {E′ : P —[ a′ - _ ]→ R′} → E ⌣₁[ a⌣a′ ] E′ → E′ ⌣₁[ ᴬ⌣-sym a⌣a′ ] E
   ⌣-sym (E ᵇ│ᵇ F) = {!!}
   ⌣-sym (E ᵇ│ᶜ F) = {!!}
   ⌣-sym (E ᶜ│ᵇ F) = {!!}
   ⌣-sym (E ᶜ│ᶜ F) = {!!}
   ⌣-sym (𝐸 │•ᵇ F) = {!!}
   ⌣-sym (𝐸 │•ᶜ F) = {!!}
   ⌣-sym (E ᵇ│• 𝐹) = {!!}
   ⌣-sym (E ᶜ│• 𝐹) = {!!}
   ⌣-sym (𝐸 │ᵥᵇ F) = {!!}
   ⌣-sym (𝐸 │ᵥᶜ F) = {!!}
   ⌣-sym (E ᵇ│ᵥ 𝐹) = {!!}
   ⌣-sym (E ᶜ│ᵥ 𝐹) = {!!}
   ⌣-sym (𝐸 ➕₁ Q) = ⌣-sym 𝐸 ➕₁ Q
   ⌣-sym (P │ᵇᵇ 𝐹) = P │ᵇᵇ ⌣-sym 𝐹
   ⌣-sym (P │ᵇᶜ 𝐹) = P │ᶜᵇ ⌣-sym 𝐹
   ⌣-sym (P │ᶜᵇ 𝐹) = P │ᵇᶜ ⌣-sym 𝐹
   ⌣-sym (P │ᶜᶜ 𝐹) = P │ᶜᶜ ⌣-sym 𝐹
   ⌣-sym (𝐸 ᵇᵇ│ Q) = ⌣-sym 𝐸 ᵇᵇ│ Q
   ⌣-sym (𝐸 ᵇᶜ│ Q) = ⌣-sym 𝐸 ᶜᵇ│ Q
   ⌣-sym (𝐸 ᶜᵇ│ Q) = ⌣-sym 𝐸 ᵇᶜ│ Q
   ⌣-sym (𝐸 ᶜᶜ│ Q) = ⌣-sym 𝐸 ᶜᶜ│ Q
   ⌣-sym (𝐸 │• 𝐹) = ⌣-sym 𝐸 │• ⌣-sym 𝐹
   ⌣-sym (𝐸 │•ᵥ 𝐹) = ⌣-sym 𝐸 │ᵥ• ⌣-sym 𝐹
   ⌣-sym (𝐸 │ᵥ• 𝐹) = ⌣-sym 𝐸 │•ᵥ ⌣-sym 𝐹
   ⌣-sym (𝐸 │ᵥ 𝐹) = ⌣-sym 𝐸 │ᵥ ⌣-sym 𝐹
   ⌣-sym (ν• 𝐸) = ν• (⌣-sym 𝐸)
   ⌣-sym (ν•ᵇ 𝐸) = {!!}
   ⌣-sym (ν•ᶜ 𝐸) = {!!}
   ⌣-sym (νᵇᵇ 𝐸) = νᵇᵇ ⌣-sym 𝐸
   ⌣-sym (νᵛᵛ 𝐸) = νᵛᵛ ⌣-sym 𝐸
   ⌣-sym (νᵇᶜ 𝐸) = νᶜᵇ ⌣-sym 𝐸
   ⌣-sym (νᶜᵇ 𝐸) = νᵇᶜ ⌣-sym 𝐸
   ⌣-sym (νᶜᶜ 𝐸) = νᶜᶜ ⌣-sym 𝐸
   ⌣-sym (! 𝐸) = ! (⌣-sym 𝐸)

{-
   syntax Concur E E′ a⌣a′ = E ⌣[ a⌣a′ ] E′

   Concur : ∀ {Γ} {a a′ : Action Γ} {P R R′}
            (E : P —[ a - _ ]→ R) (E′ : P —[ a′ - _ ]→ R′) → a ᴬ⌣ a′ → Set
   Concur E E′ a⌣a′ = E ⌣₁[ a⌣a′ ] E′ ⊎ E′ ⌣₁[ ᴬ⌣-sym a⌣a′ ] E

   ⌣-sym : ∀ {Γ} {P : Proc Γ} {a a′ : Action Γ} {a⌣a′ : a ᴬ⌣ a′} {R R′} →
           {E : P —[ a - _ ]→ R} {E′ : P —[ a′ - _ ]→ R′} → E ⌣[ a⌣a′ ] E′ → E′ ⌣[ ᴬ⌣-sym a⌣a′ ] E
   ⌣-sym (inj₁ E⌣E′) = inj₂ (subst (Concur₁ _ _) (sym (ᴬ⌣-sym-involutive _)) E⌣E′)
   ⌣-sym (inj₂ E⌣E′) = inj₁ E⌣E′

   -- The type of the symmetric residual of concurrent transitions E and E′. Because cofinality of action
   -- residuals isn't baked in, need to coerce targets of E/E′ and E′/E to the same type.
   record Delta′ {Γ P} {a a′ : Action Γ} (a⌣a′ : a ᴬ⌣ a′) {R R′}
                (E : P —[ a - _ ]→ R) (E′ : P —[ a′ - _ ]→ R′) : Set where
      constructor Delta
      a′/a = π₁ (ᴬ⊖ a⌣a′)
      a/a′ = π₂ (ᴬ⊖ a⌣a′)
      Γ′ = Γ + inc₂ (a , a′/a)
      field
         {S S′} : Proc Γ′
         E′/E : R —[ a′/a - _ ]→ subst Proc (inc₂-def a⌣a′) S
         E/E′ : R′ —[ a/a′ - _ ]→ subst Proc (trans (inc₂-def a⌣a′) (ᴬ⊖-✓ a⌣a′)) S′

   infixl 5 Delta
   syntax Delta E E′ = E ᵀΔ E′
   syntax Delta′ a⌣a′ E E′ = E Δ′[ a⌣a′ ] E′

   open import Ren.Properties
   open Delta′

   -- The symmetric residual (E′/E , E/E′). The paper defines the residual using E and E′, with E ⌣ E′
   -- implicit; here we work directly with the proof of E ⌣ E′ and leave E and E′ implicit.
   ⊖₁ : ∀ {Γ P} {a a′ : Action Γ} {a⌣a′ : a ᴬ⌣ a′} {R R′} {E : P —[ a - _ ]→ R} {E′ : P —[ a′ - _ ]→ R′} →
        E ⌣₁[ a⌣a′ ] E′ → E Δ′[ a⌣a′ ] E′
   ⊖₁ (E ᵇ│ᵇ F) = target E │ᵇ (push *ᵇ) F ᵀΔ (push *ᵇ) E ᵇ│ target F
   ⊖₁ (E ᵇ│ᶜ F) = target E │ᶜ (push *ᶜ) F ᵀΔ E ᵇ│ target F
   ⊖₁ (E ᶜ│ᵇ F) = target E │ᵇ F ᵀΔ (push *ᶜ) E ᶜ│ target F
   ⊖₁ (E ᶜ│ᶜ F) = target E │ᶜ F ᵀΔ E ᶜ│ target F
   ⊖₁ (_│•ᵇ_ {y = y} {a = a} E⌣E′ F) with (pop y *ᵇ) (E/E′ (⊖₁ E⌣E′))
   ... | pop-y*E/E′ rewrite pop∘push y a = E′/E (⊖₁ E⌣E′) │• (push *ᶜ) F ᵀΔ pop-y*E/E′ ᵇ│ target F
   ⊖₁ (_│•ᶜ_ {y = y} {a = a} E⌣E′ F) with (pop y *ᶜ) (E/E′ (⊖₁ E⌣E′))
   ... | pop-y*E/E′ rewrite pop∘push y a = E′/E (⊖₁ E⌣E′) │• F ᵀΔ pop-y*E/E′ ᶜ│ target F
   ⊖₁ (_ᵇ│•_ {y = y} E F⌣F′) = (push *ᵇ) E ᵀ.│• E′/E (⊖₁ F⌣F′) ᵀΔ (pop y *) (target E) │ᵇ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (_ᶜ│•_ {y = y} E F⌣F′) = E │• E′/E (⊖₁ F⌣F′) ᵀΔ (pop y *) (target E) │ᶜ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (E⌣E′ │ᵥᵇ F) = E′/E (⊖₁ E⌣E′) │ᵥ (push *ᵇ) F ᵀΔ νᵇ (E/E′ (⊖₁ E⌣E′) ᵇ│ target F)
   ⊖₁ (E⌣E′ │ᵥᶜ F) = E′/E (⊖₁ E⌣E′) │ᵥ F ᵀΔ νᶜ (E/E′ (⊖₁ E⌣E′) ᶜ│ target F)
   ⊖₁ (_ᵇ│ᵥ_ {a⌣a′ = ᵛ∇ᵛ} E F⌣F′) with (push *ᵇ) E
   ... | push*E = push*E │• E′/E (⊖₁ F⌣F′) ᵀΔ ν• (target E │ᶜ E/E′ (⊖₁ F⌣F′))
   ⊖₁ (_ᵇ│ᵥ_ {a⌣a′ = ᵇ∇ᵇ} E F⌣F′) = (push *ᵇ) E │ᵥ E′/E (⊖₁ F⌣F′) ᵀΔ νᵇ (target E │ᵇ E/E′ (⊖₁ F⌣F′))
   ⊖₁ (E ᶜ│ᵥ F⌣F′) = E │ᵥ E′/E (⊖₁ F⌣F′) ᵀΔ νᶜ (target E │ᶜ E/E′ (⊖₁ F⌣F′))
   ⊖₁ (_│ᵇᵇ_ {a⌣a′ = ᵛ∇ᵛ} P F⌣F′) = (push *) P │ᶜ E′/E (⊖₁ F⌣F′) ᵀΔ (push *) P │ᶜ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (_│ᵇᵇ_ {a⌣a′ = ᵇ∇ᵇ} P F⌣F′) = (push *) P │ᵇ E′/E (⊖₁ F⌣F′) ᵀΔ (push *) P │ᵇ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (P │ᵇᶜ F⌣F′) = (push *) P │ᶜ E′/E (⊖₁ F⌣F′) ᵀΔ P │ᵇ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (P │ᶜᵇ F⌣F′) = P │ᵇ E′/E (⊖₁ F⌣F′) ᵀΔ (push *) P │ᶜ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (P │ᶜᶜ F⌣F′) = P │ᶜ E′/E (⊖₁ F⌣F′) ᵀΔ P │ᶜ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (_ᵇᵇ│_ {a⌣a′ = ᵛ∇ᵛ} E⌣E′ Q) = E′/E (⊖₁ E⌣E′) ᶜ│ (push *) Q ᵀΔ E/E′ (⊖₁ E⌣E′) ᶜ│ (push *) Q
   ⊖₁ (_ᵇᵇ│_ {a⌣a′ = ᵇ∇ᵇ} E⌣E′ Q) = E′/E (⊖₁ E⌣E′) ᵇ│ (push *) Q ᵀΔ E/E′ (⊖₁ E⌣E′) ᵇ│ (push *) Q
   ⊖₁ (E⌣E′ ᵇᶜ│ Q) = E′/E (⊖₁ E⌣E′) ᶜ│ (push *) Q ᵀΔ E/E′ (⊖₁ E⌣E′) ᵇ│ Q
   ⊖₁ (E⌣E′ ᶜᵇ│ Q) = E′/E (⊖₁ E⌣E′) ᵇ│ Q ᵀΔ E/E′ (⊖₁ E⌣E′) ᶜ│ (push *) Q
   ⊖₁ (E⌣E′ ᶜᶜ│ Q) = E′/E (⊖₁ E⌣E′) ᶜ│ Q ᵀΔ E/E′ (⊖₁ E⌣E′) ᶜ│ Q
   ⊖₁ (E⌣E′ ➕₁ F) = E′/E (⊖₁ E⌣E′) ᵀΔ E/E′ (⊖₁ E⌣E′)
   ⊖₁ (_│•_ {x = x} {y} {u} {z} E⌣E′ F⌣F′) with (pop y *ᵇ) (E′/E (⊖₁ E⌣E′)) | (pop z *ᵇ) (E/E′ (⊖₁ E⌣E′))
   ... | pop-y*E′/E | pop-z*E/E′ rewrite pop∘push u y | pop∘push x z = pop-y*E′/E │• E′/E (⊖₁ F⌣F′) ᵀΔ pop-z*E/E′ │• E/E′ (⊖₁ F⌣F′)
   ⊖₁ (_│•ᵥ_ {u = u} {y} E⌣E′ F⌣F′) with (pop y *ᵇ) (E′/E (⊖₁ E⌣E′))
   ... | pop-y*E′/E rewrite pop∘push u y = pop-y*E′/E │ᵥ E′/E (⊖₁ F⌣F′) ᵀΔ νᶜ (E/E′ (⊖₁ E⌣E′) │• E/E′ (⊖₁ F⌣F′))
   ⊖₁ (_│ᵥ•_ {x = x} {y = y} E⌣E′ F⌣F′) with (pop y *ᵇ) (E/E′ (⊖₁ E⌣E′))
   ... | pop-y*E/E′ rewrite pop∘push x y = νᶜ (E′/E (⊖₁ E⌣E′) │• E′/E (⊖₁ F⌣F′)) ᵀΔ pop-y*E/E′ │ᵥ E/E′ (⊖₁ F⌣F′)
   ⊖₁ (_│ᵥ_ {•x⌣•u = ᵛ∇ᵛ} E⌣E′ F⌣F′) = νᶜ (E′/E (⊖₁ E⌣E′) │• E′/E (⊖₁ F⌣F′)) ᵀΔ νᶜ (E/E′ (⊖₁ E⌣E′) │• E/E′ (⊖₁ F⌣F′))
   ⊖₁ (_│ᵥ_ {•x⌣•u = ᵇ∇ᵇ} E⌣E′ F⌣F′) = νᶜ (E′/E (⊖₁ E⌣E′) │ᵥ E′/E (⊖₁ F⌣F′)) ᵀΔ νᶜ (E/E′ (⊖₁ E⌣E′) │ᵥ E/E′ (⊖₁ F⌣F′))
   ⊖₁ (ν• E⌣E′) = E′/E (⊖₁ E⌣E′) ᵀΔ E/E′ (⊖₁ E⌣E′)
   ⊖₁ (ν•ᵇ_ {x = x} {a = a} E⌣E′) with (swap *ᶜ) (E/E′ (⊖₁ E⌣E′))
   ... | swap*E/E′ = E′/E (⊖₁ E⌣E′) ᵀΔ ν• swap*E/E′
   ⊖₁ (ν•ᶜ E⌣E′) = E′/E (⊖₁ E⌣E′) ᵀΔ ν• E/E′ (⊖₁ E⌣E′)
   ⊖₁ (νᵇᵇ_ {a = x •} {a} E⌣E′) with (swap *ᵇ) (E/E′ (⊖₁ E⌣E′)) | (swap *ᵇ) (E′/E (⊖₁ E⌣E′))
   ... | swap*E/E′ | swap*E′/E rewrite swap∘push∘push x | swap∘push∘push a = νᵇ swap*E′/E ᵀΔ νᵇ swap*E/E′
   ⊖₁ (νᵇᵇ_ {a = • x} {u •} E⌣E′) with (swap *ᵇ) (E/E′ (⊖₁ E⌣E′)) | (swap *ᵇ) (E′/E (⊖₁ E⌣E′))
   ... | swap*E/E′ | swap*E′/E rewrite swap∘push∘push x | swap∘push∘push u = νᵇ swap*E′/E ᵀΔ νᵇ swap*E/E′
   ⊖₁ (νᵇᵇ_ {a = • x} {• u} E⌣E′) with (swap *ᵇ) (E/E′ (⊖₁ E⌣E′)) | (swap *ᵇ) (E′/E (⊖₁ E⌣E′))
   ... | swap*E/E′ | swap*E′/E = νᵇ swap*E′/E ᵀΔ νᵇ swap*E/E′
   ⊖₁ (νᵛᵛ_ {x = x} {u} E⌣E′) with (swap *ᶜ) (E/E′ (⊖₁ E⌣E′)) | (swap *ᶜ) (E′/E (⊖₁ E⌣E′))
   ... | swap*E/E′ | swap*E′/E = νᶜ swap*E′/E ᵀΔ νᶜ swap*E/E′
   ⊖₁ (νᵇᶜ_ {a′ = a′} E⌣E′) with (swap *ᶜ) (E′/E (⊖₁ E⌣E′))
   ... | swap*E′/E rewrite swap∘push∘push a′ = νᶜ swap*E′/E ᵀΔ νᵇ E/E′ (⊖₁ E⌣E′)
   ⊖₁ (νᶜᵇ_ {a = a} E⌣E′) with (swap *ᶜ) (E/E′ (⊖₁ E⌣E′))
   ... | swap*E/E′ rewrite swap∘push∘push a = νᵇ E′/E (⊖₁ E⌣E′) ᵀΔ νᶜ swap*E/E′
   ⊖₁ (νᶜᶜ E⌣E′) = νᶜ (E′/E (⊖₁ E⌣E′)) ᵀΔ νᶜ (E/E′ (⊖₁ E⌣E′))
   ⊖₁ (! E⌣E′) = E′/E (⊖₁ E⌣E′) ᵀΔ E/E′ (⊖₁ E⌣E′)

   -- Now symmetrise.
   ⊖ : ∀ {Γ P} {a a′ : Action Γ} {a⌣a′ : a ᴬ⌣ a′} {R R′} {E : P —[ a - _ ]→ R} {E′ : P —[ a′ - _ ]→ R′} →
       E ⌣[ a⌣a′ ] E′ → E Δ′[ a⌣a′ ] E′
   ⊖ (inj₁ E⌣E′) = ⊖₁ E⌣E′
   ⊖ {a⌣a′ = a⌣a′} (inj₂ E′⌣E) with ⊖₁ E′⌣E
   ⊖ {a⌣a′ = ᵛ∇ᵛ} (inj₂ E′⌣E) | E/E′ ᵀΔ E′/E = E′/E ᵀΔ E/E′
   ⊖ {a⌣a′ = ᵇ∇ᵇ} (inj₂ E′⌣E) | E/E′ ᵀΔ E′/E = E′/E ᵀΔ E/E′
   ⊖ {a⌣a′ = ᵇ∇ᶜ} (inj₂ E′⌣E) | E/E′ ᵀΔ E′/E = E′/E ᵀΔ E/E′
   ⊖ {a⌣a′ = ᶜ∇ᵇ} (inj₂ E′⌣E) | E/E′ ᵀΔ E′/E = E′/E ᵀΔ E/E′
   ⊖ {a⌣a′ = ᶜ∇ᶜ} (inj₂ E′⌣E) | E/E′ ᵀΔ E′/E = E′/E ᵀΔ E/E′
-}
